Revit 2027 API
ParameterTypeId.StairstypeMinimumTreadDepth Property
 "Min. Tread Depth": Minimum Tread Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeMinimumTreadDepth { get; }
Public Shared ReadOnly Property StairstypeMinimumTreadDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeMinimumTreadDepth {
	ForgeTypeId^ get ();
}
static member StairstypeMinimumTreadDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace